# SQLAlchemy Library

The **sqlalchemy** library reads/writes data from/to an SQL database. It works with Pandas DataFrames.
In this example, an SQLite databse is create in memory and the data from a dataframe is copied into the databse.

In [22]:
# First, an engine must be created in memory.
# The engine provides a source of connectivity to the database.
from sqlalchemy import create_engine

In [23]:
# The engine is created. 'sqlite' is called the 'dialect' which specifies the type of database.
# The SQLite database in created in 'memory'.
engine = create_engine('sqlite:///:memory:')

In [24]:
# Sample DataFrame
import numpy as np
import pandas as pd
dict = {'A':[0, 1, 2, 3],'B':[4, 5, 6, 7],'C':[8, 9, 10, 11],'D':[12, 13, 14, 15]}
df = pd.DataFrame(dict)
df

   A  B   C   D
0  0  4   8  12
1  1  5   9  13
2  2  6  10  14
3  3  7  11  15

In [25]:
# The data from our dataframe is copied into the SQLite database as a table named 'my_table'.
df.to_sql('my_table', engine)

4

In [26]:
# Now, read data from the database. The data is converted to a Pandas dataframe.
# The connection to the database is made by 'engine'.
sql_df = pd.read_sql('my_table',con=engine)

In [27]:
sql_df

   index  A  B   C   D
0      0  0  4   8  12
1      1  1  5   9  13
2      2  2  6  10  14
3      3  3  7  11  15